Constructs default options for energy analysis detailed model creation.
  Namespace:   Autodesk.Revit.DB.Analysis
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2012
 Syntax
  C#
public EnergyAnalysisDetailModelOptions()
  Visual Basic
Public Sub New
  Visual C++
public:
EnergyAnalysisDetailModelOptions()
 See Also
  EnergyAnalysisDetailModelOptions Class
  Autodesk.Revit.DB.Analysis Namespace